---
title: Numeric Functions
---

# Numeric Function Reference

<!-- DOCSGEN_START numeric_functions -->

## `%`

Returns the remainder after dividing the left value by the right value.

**Example**: `10 % 3`

**Output**: `1`

## `*`

Multiplies two numeric values.

**Example**: `5 * 3`

**Output**: `15`

## `+`

Adds two numeric values together.

**Example**: `5 + 3`

**Output**: `8`

## `-`

Subtracts the right value from the left value.

**Example**: `10 - 4`

**Output**: `6`

## `/`

Divides the left value by the right value.

**Example**: `15 / 3`

**Output**: `5`

## `abs`

Compute the absolute value of a number.

## `acos`

Compute the arccosine of value.

## `acosh`

Compute the inverse hyperbolic cosine of value.

## `add`

Adds two numeric values together.

**Example**: `5 + 3`

**Output**: `8`

## `asin`

Compute the arcsine of value.

## `asinh`

Compute the inverse hyperbolic sine of value.

## `atan`

Compute the arctangent of value.

## `atan2`

Compute the arctangent of y/x.

## `atanh`

Compute the inverse hyperbolic tangent of value.

## `cbrt`

Compute the cube root of value.

## `ceil`

Round number up.

## `cos`

Compute the cosine of a value.

## `cosh`

Compute the hyperbolic cosine of value.

## `cot`

Compute the cotangent of value.

## `degrees`

Convert radians to degrees.

## `div`

Divides the left value by the right value.

**Example**: `15 / 3`

**Output**: `5`

## `exp`

Compute `e ^ val`.

## `floor`

Round number down.

## `gcd`

Compute the greatest common divisor of two integers.

**Example**: `gcd(12, 8)`

**Output**: `4`

## `is_nan`

Return if the given float is a NaN.

**Example**: `isnan('NaN'::FLOAT)`

**Output**: `true`

## `isfinite`

Return if the given float is finite.

**Example**: `isfinite(1.0)`

**Output**: `true`

## `isinf`

Return if the given float is infinite (positive or negative infinity).

**Example**: `isinf('Infinity'::FLOAT)`

**Output**: `true`

## `lcm`

Calculates the least common multiple of two integers.

**Example**: `lcm(12, 18)`

**Output**: `36`

## `ln`

Compute natural log of value.

## `log`

Compute base-10 log of value.

## `log2`

Compute base-2 log of value.

## `mul`

Multiplies two numeric values.

**Example**: `5 * 3`

**Output**: `15`

## `negate`

Returns the result of multiplying the input value by -1.

**Example**: `negate(-3.5)`

**Output**: `3.5`

## `pi`

Return the value of pi.

**Example**: `pi()`

**Output**: `3.141592653589793`

## `pow`

Compute base raised to the power of exponent.

## `power`

Compute base raised to the power of exponent.

## `radians`

Convert degrees to radians.

## `random`

Return a random float.

## `rem`

Returns the remainder after dividing the left value by the right value.

**Example**: `10 % 3`

**Output**: `1`

## `round`

Round a number to a given scale.

**Example**: `round(3.14159, 2)`

**Output**: `3.14`

## `round`

Round a number to the nearest whole value.

**Example**: `round(3.14159)`

**Output**: `3`

## `shl`

Shifts an integer left by a specified number of bits.

**Example**: `shl(4, 1)`

**Output**: `8`

## `shr`

Shifts an integer right by a specified number of bits.

**Example**: `shr(8, 1)`

**Output**: `4`

## `sin`

Compute the sin of value.

## `sinh`

Compute the hyperbolic sine of value.

## `sqrt`

Compute the square root of value.

## `sub`

Subtracts the right value from the left value.

**Example**: `10 - 4`

**Output**: `6`

## `tan`

Compute the tangent of value.

## `tanh`

Compute the hyperbolic tangent of value.

## `trunc`

Truncate number towards zero.

**Example**: `trunc(-1.9)`

**Output**: `-1`

## `xor`

Performs a bitwise XOR operation on two integers.

**Example**: `xor(5, 3)`

**Output**: `6`


<!-- DOCSGEN_END -->
